loadtest/artillery/integrated-load-test.yml
config:
  target: "{{ $processEnvironment.API_ENDPOINT || 'http://localhost:8080' }}"
  phases:
    # ウォームアップフェーズ
    - duration: 10
      arrivalRate: 1
      name: "ウォームアップ"

    # 段階的負荷増加
    - duration: 10
      arrivalRate: 5
      rampTo: 15
      name: "負荷増加"

    # ピーク負荷維持
    - duration: 10
      arrivalRate: 25
      name: "ピーク負荷"

    # ストレステスト
    - duration: 10
      arrivalRate: 50
      name: "ストレステスト"

    # クールダウン
    - duration: 10
      arrivalRate: 5
      name: "クールダウン"

  http:
    timeout: 10
    pool: 50

  # WebSocketの設定
  ws:
    timeout: 30

  # 環境変数の設定
  environments:
    local:
      target: "http://localhost:8080"
      wsTarget: "ws://localhost:8080"
      userPageUrl: "http://localhost:3000"

    production:
      target: "https://bingo-api.nutfes.net"
      wsTarget: "wss://bingo-api.nutfes.net"
      userPageUrl: "https://bingo.nutfes.net"

  # カスタムメトリクス
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true

  # プロセッサー関数
  processor: "./artillery-processor.js"

scenarios:
  # シナリオ1: 一般ユーザーのビンゴ閲覧
  - name: "ユーザービンゴ閲覧"
    weight: 70
    flow:
      - post:
          url: "/v1/graphql"
          headers:
            Content-Type: "application/json"
            x-hasura-admin-secret: "/4XQdRUHXGtW"
          json:
            query: |
              query GetBingoNumbers {
                bingo_numbers(order_by: {id: asc}) {
                  id
                  number
                  is_called
                  created_at
                  updated_at
                }
              }
          capture:
            - json: "$.data.bingo_numbers"
              as: "bingoNumbers"
          expect:
            - statusCode: 200
            - hasProperty: "data.bingo_numbers"

      - think: 1

      - post:
          url: "/v1/graphql"
          headers:
            Content-Type: "application/json"
            x-hasura-admin-secret: "/4XQdRUHXGtW"
          json:
            query: |
              query GetPrizes {
                prizes(order_by: {id: asc}) {
                  id
                  name
                  description
                  image_url
                  is_available
                  winner_count
                  total_count
                  created_at
                  updated_at
                }
              }
          capture:
            - json: "$.data.prizes"
              as: "prizes"
          expect:
            - statusCode: 200
            - hasProperty: "data.prizes"

      - think: 2

      # ユーザーのビンゴカード取得
      - function: "getUserId"

      - post:
          url: "/v1/graphql"
          headers:
            Content-Type: "application/json"
            x-hasura-admin-secret: "/4XQdRUHXGtW"
          json:
            query: |
              query GetUserBingoCard($userId: String!) {
                bingo_cards(where: {user_id: {_eq: $userId}}) {
                  id
                  user_id
                  card_data
                  is_completed
                  completed_at
                  created_at
                  updated_at
                }
              }
            variables:
              userId: "{{ userId }}"
          expect:
            - statusCode: 200

      - think: 3

  # シナリオ2: リアルタイム更新のWebSocket接続
  - name: "WebSocket リアルタイム更新"
    weight: 20
    engine: ws
    flow:
      - connect:
          target: "wss://bingo-api.nutfes.net/v1/graphql"
          subprotocols:
            - "graphql-ws"

      - send:
          payload: |
            {
              "type": "connection_init",
              "payload": {
                "headers": {
                  "x-hasura-admin-secret": "/4XQdRUHXGtW"
                }
              }
            }

      - think: 1

      - send:
          payload: |
            {
              "id": "bingo_numbers_sub",
              "type": "start",
              "payload": {
                "query": "subscription SubscribeBingoNumbers { bingo_numbers(order_by: {id: asc}) { id number is_called created_at updated_at } }"
              }
            }

      - send:
          payload: |
            {
              "id": "prizes_sub",
              "type": "start",
              "payload": {
                "query": "subscription SubscribePrizes { prizes(order_by: {id: asc}) { id name description image_url is_available winner_count total_count created_at updated_at } }"
              }
            }

      - think: 30

      - send:
          payload: |
            {
              "id": "bingo_numbers_sub",
              "type": "stop"
            }

      - send:
          payload: |
            {
              "id": "prizes_sub",
              "type": "stop"
            }

      - send:
          payload: |
            {
              "type": "connection_terminate"
            }

  # シナリオ3: ユーザーページ閲覧
  - name: "ユーザーページ閲覧"
    weight: 10
    flow:
      - get:
          url: "{{ $processEnvironment.USER_PAGE_URL || userPageUrl }}"
          expect:
            - statusCode: 200

      - think: 3

      # ページ内のリソース読み込みをシミュレート
      - get:
          url: "{{ $processEnvironment.USER_PAGE_URL || userPageUrl }}/favicon.ico"
          expect:
            - statusCode: [200, 404]

      - think: 2